Revit 2027 API
Stone.StoneColor Property
 The property labeled "Image" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string StoneColor { get; }
Public Shared ReadOnly Property StoneColor As String
	Get
public:
static property String^ StoneColor {
	String^ get ();
}
static member StoneColor : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Stone Class
Autodesk.Revit.DB.Visual Namespace